Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# CmdAlias_data_case_lower_text
source: case unicode encoding
ar: case unicode encoding حالة الأحرف ترميز
cs: malá mala písmena pismena kódování kodovani case unicode encoding
de: klein schreibung codierung case unicode encoding
el: πεζά-κεφαλαία κωδικοποίηση case unicode encoding
es: minúsculas codificación case unicode encoding
fa: بزرگی حروف رمزگذاری, case unicode encoding
fr: casse minuscules encodage case unicode encoding
hu: kisbetű kisbetu kódolás kodolas case unicode encoding
id: huruf kecil pengodean case unicode encoding
it: maiuscole minuscole codifica unicode case unicode encoding
ja: こもじに もじこーど
ko: 소문자 변환 유니코드 인코딩 case unicode encoding
pl: wielkość liter kodowanie unicode case unicode encoding
pt: maiúsculas minúsculas codificação unicode case unicode encoding
ro: minuscule litere mici codificare case unicode encoding
th: ตัวพิมพ์เล็ก การเข้ารหัส case unicode encoding
tr: harf kodlama case unicode encoding
uk: регістр кодування case unicode encoding
vi: chữ thường bảng mã case unicode encoding
zh_hans: 小写 大小写 编码 case unicode encoding
zh_hant: 小寫 大小寫 編碼 case unicode encoding

# Cmd_data_case_swap
source: Swap case
ar: تبديل حالة الأحرف
cs: Prohodit velikost písmen
de: Groß-/Kleinschreibung umkehren
el: Εναλλαγή πεζών-κεφαλαίων
es: Invertir mayúsculas y minúsculas
fa: جابه‌جایی بزرگی و کوچکی حروف
fr: Inverser la casse
hu: Kis- és nagybetűk felcserélése
id: Tukar huruf besar/kecil
it: Inverti maiuscole/minuscole
ja: 大文字と小文字を入れ替える
ko: 대/소문자 바꾸기
pl: Odwróć wielkość liter
pt: Inverter maiúsculas/minúsculas
ro: Inversare majuscule/minuscule
th: สลับตัวพิมพ์
tr: Harf durumunu tersine çevir
uk: Інвертувати регістр
vi: Đảo chữ hoa/thường
zh_hans: 大小写互换
zh_hant: 大小寫互換

# CmdAlias_data_case_swap
source: case swap case
ar: case swap case تبديل حالة الأحرف
cs: prohodit velikost písmen pismen velká malá case swap case
de: schreibung umkehren case swap case
el: εναλλαγή πεζών-κεφαλαίων case swap case
es: invertir mayúsculas minúsculas case swap case
fa: جابه‌جایی بزرگی حروف, case swap case
fr: inverser casse case swap case
hu: kisbetű nagybetű felcserélés felcsereles case swap case
id: tukar huruf besar kecil case swap case
it: inverti maiuscole minuscole case swap case
ja: おおもじとこもじをいれかえる
ko: 대소문자 바꾸기 반전 case swap case
pl: odwróć wielkość liter case swap case
pt: inverter maiúsculas minúsculas case swap case
ro: inversare majuscule minuscule case swap case
th: สลับตัวพิมพ์ case swap case
tr: harf ters case swap case
uk: регістр інвертувати case swap case
vi: đảo chữ hoa thường case swap case
zh_hans: 大小写互换 切换大小写 case swap case
zh_hant: 大小寫互換 case swap case

# Cmd_data_case_swap_ascii
source: Swap case (ASCII letters only)
ar: تبديل حالة الأحرف (أحرف ASCII فقط)
cs: Prohodit velikost písmen (jen písmena ASCII)
de: Groß-/Kleinschreibung umkehren (nur ASCII-Buchstaben)
el: Εναλλαγή πεζών-κεφαλαίων (μόνο γράμματα ASCII)
es: Invertir mayúsculas y minúsculas (solo letras ASCII)
fa: جابه‌جایی بزرگی و کوچکی حروف (فقط حروف ASCII)
fr: Inverser la casse (lettres ASCII uniquement)
hu: Kis- és nagybetűk felcserélése (csak ASCII betűk)
id: Tukar huruf besar/kecil (hanya huruf ASCII)
it: Inverti maiuscole/minuscole (solo lettere ASCII)
ja: 大文字と小文字を入れ替える (ASCII の英字だけ)
ko: 대/소문자 바꾸기(ASCII 영문자만)
pl: Odwróć wielkość liter (tylko litery ASCII)
pt: Inverter maiúsculas/minúsculas (somente letras ASCII)
ro: Inversare majuscule/minuscule (doar literele ASCII)
th: สลับตัวพิมพ์ (เฉพาะตัวอักษร ASCII)
tr: Harf durumunu tersine çevir (yalnızca ASCII harfleri)
uk: Інвертувати регістр (лише літери ASCII)
vi: Đảo chữ hoa/thường (chỉ chữ cái ASCII)
zh_hans: 大小写互换（仅 ASCII 字母）
zh_hant: 大小寫互換（僅 ASCII 字母）

# CmdAlias_data_case_swap_ascii
source: case ascii
ar: case ascii حالة الأحرف
cs: prohodit velikost písmen pismen case ascii
de: schreibung umkehren case ascii
el: πεζά-κεφαλαία case ascii
es: invertir mayúsculas minúsculas case ascii
fa: بزرگی حروف, case ascii
fr: inverser casse case ascii
hu: kisbetű nagybetű felcserélés felcsereles case ascii
id: tukar huruf case ascii
it: maiuscole minuscole ascii case ascii
ja: おおもじとこもじをいれかえる あすきー
ko: 대소문자 바꾸기 영문자 case ascii
pl: wielkość liter ascii case ascii
pt: maiúsculas minúsculas ascii case ascii
ro: inversare majuscule minuscule case ascii
th: สลับตัวพิมพ์ case ascii
tr: harf case ascii
uk: регістр case ascii
vi: đảo chữ hoa thường case ascii
zh_hans: 大小写互换 case ascii
zh_hant: 大小寫互換 case ascii

# Cmd_data_case_swap_text
source: Swap case (by text encoding)
ar: تبديل حالة الأحرف (حسب ترميز النص)
cs: Prohodit velikost písmen (podle kódování textu)
de: Groß-/Kleinschreibung umkehren (nach Textcodierung)
el: Εναλλαγή πεζών-κεφαλαίων (κατά κωδικοποίηση κειμένου)
es: Invertir mayúsculas y minúsculas (según la codificación del texto)
fa: جابه‌جایی بزرگی و کوچکی حروف (بر اساس رمزگذاری متن)
fr: Inverser la casse (selon l'encodage du texte)
hu: Kis- és nagybetűk felcserélése (szövegkódolás szerint)
id: Tukar huruf besar/kecil (menurut pengodean teks)
it: Inverti maiuscole/minuscole (secondo la codifica del testo)
ja: 大文字と小文字を入れ替える (文字コードに従う)
ko: 대/소문자 바꾸기(텍스트 인코딩 기준)
pl: Odwróć wielkość liter (wg kodowania tekstu)
pt: Inverter maiúsculas/minúsculas (pela codificação de texto)
ro: Inversare majuscule/minuscule (după codificarea textului)
th: สลับตัวพิมพ์ (ตามการเข้ารหัสข้อความ)
tr: Harf durumunu tersine çevir (metin kodlamasına göre)
uk: Інвертувати регістр (за кодуванням тексту)
vi: Đảo chữ hoa/thường (theo bảng mã văn bản)
zh_hans: 大小写互换（按文本编码）
zh_hant: 大小寫互換（依文字編碼）

# CmdAlias_data_case_swap_text
source: case unicode encoding
ar: case unicode encoding حالة الأحرف ترميز
cs: prohodit velikost písmen pismen kódování kodovani case unicode encoding
de: schreibung umkehren codierung case unicode encoding
el: πεζά-κεφαλαία κωδικοποίηση case unicode encoding
es: invertir mayúsculas minúsculas codificación case unicode encoding
fa: بزرگی حروف رمزگذاری, case unicode encoding
fr: inverser casse encodage case unicode encoding
hu: kisbetű nagybetű felcserélés felcsereles kódolás kodolas case unicode encoding
id: tukar huruf pengodean case unicode encoding
it: maiuscole minuscole codifica unicode case unicode encoding
ja: おおもじとこもじをいれかえる もじこーど
ko: 대소문자 바꾸기 유니코드 인코딩 case unicode encoding
pl: wielkość liter kodowanie unicode case unicode encoding
pt: maiúsculas minúsculas codificação unicode case unicode encoding
ro: inversare majuscule minuscule codificare case unicode encoding
th: สลับตัวพิมพ์ การเข้ารหัส case unicode encoding
tr: harf kodlama case unicode encoding
uk: регістр кодування case unicode encoding
vi: đảo chữ hoa thường bảng mã case unicode encoding
zh_hans: 大小写互换 编码 case unicode encoding
zh_hant: 大小寫互換 編碼 case unicode encoding

# Cmd_data_convertEncoding
source: Convert encoding...
ar: تحويل الترميز...
cs: Převést kódování...
de: Codierung konvertieren...
el: Μετατροπή κωδικοποίησης...
es: Convertir codificación...
fa: تبدیل رمزگذاری...
fr: Convertir l'encodage...
hu: Kódolás átalakítása...
id: Konversi pengodean...
it: Converti codifica...
ja: 文字コード変換...
ko: 인코딩 변환...
pl: Konwertuj kodowanie...
pt: Converter codificação...
ro: Conversie codificare...
th: แปลงการเข้ารหัส...
tr: Kodlamayı dönüştür...
uk: Перетворити кодування...
vi: Chuyển đổi bảng mã...
zh_hans: 转换编码...
zh_hant: 轉換編碼...

# CmdAlias_data_convertEncoding
source: charset transcode utf-8 shift_jis ebcdic
ar: charset transcode utf-8 shift_jis ebcdic تحويل الترميز
cs: převést prevest kódování kodovani znaková sada charset transcode utf-8 shift_jis ebcdic
de: zeichensatz umcodieren charset transcode utf-8 shift_jis ebcdic
el: κωδικοποίηση μετατροπή charset transcode utf-8 shift_jis ebcdic
es: juego de caracteres transcodificar charset transcode utf-8 shift_jis ebcdic
fa: تبدیل رمزگذاری, charset transcode utf-8 shift_jis ebcdic
fr: jeu de caractères transcoder charset transcode utf-8 shift_jis ebcdic
hu: kódolás kodolas átalakítás atalakitas karakterkészlet konvertálás charset transcode utf-8 shift_jis ebcdic
id: konversi pengodean set karakter charset transcode utf-8 shift_jis ebcdic
it: codifica set di caratteri transcodifica charset transcode utf-8 shift_jis ebcdic
ja: もじこーどへんかん
ko: 인코딩 변환 문자 코드 문자 집합 charset transcode utf-8 shift_jis ebcdic
pl: kodowanie zestaw znaków transkoduj charset transcode utf-8 shift_jis ebcdic
pt: codificação conjunto de caracteres transcodificar charset transcode utf-8 shift_jis ebcdic
ro: conversie codificare set caractere transcodare charset transcode utf-8 shift_jis ebcdic
th: แปลง การเข้ารหัส ชุดอักขระ charset transcode utf-8 shift_jis ebcdic
tr: karakter kümesi dönüştür charset transcode utf-8 shift_jis ebcdic
uk: кодування перекодувати charset transcode utf-8 shift_jis ebcdic
vi: chuyển đổi bảng mã bộ ký tự charset transcode utf-8 shift_jis ebcdic
zh_hans: 转换 编码 字符集 转码 charset transcode utf-8 shift_jis ebcdic
zh_hant: 轉換編碼 文字編碼 字元集 charset transcode utf-8 shift_jis ebcdic

# Cmd_analysis_hash_customCrc
source: Define custom CRC...
ar: تعريف CRC مخصص...
cs: Definovat vlastní CRC...
de: Benutzerdefinierten CRC definieren...
el: Ορισμός προσαρμοσμένου CRC...
es: Definir CRC personalizado...
fa: تعریف CRC سفارشی...
fr: Définir un CRC personnalisé...
hu: Egyéni CRC definiálása...
id: Definisikan CRC kustom...
it: Definisci CRC personalizzato...
ja: カスタム CRC を定義...
ko: 사용자 지정 CRC 정의...
pl: Zdefiniuj niestandardowy CRC...
pt: Definir CRC personalizado...
ro: Definire CRC personalizat...
th: กำหนด CRC เอง...
tr: Özel CRC tanımla...
uk: Визначити власний CRC...
vi: Định nghĩa CRC tùy chỉnh...
zh_hans: 定义自定义 CRC...
zh_hant: 定義自訂 CRC...

# CmdAlias_analysis_hash_customCrc
source: crc polynomial
ar: crc polynomial متعدد الحدود
cs: vlastní vlastni polynom crc polynomial
de: crc polynom crc polynomial
el: πολυώνυμο crc polynomial
es: crc polinomio crc polynomial
fa: چندجمله‌ای, crc polynomial
fr: crc polynôme crc polynomial
hu: egyéni egyeni crc polinom crc polynomial
id: crc kustom polinomial crc polynomial
it: crc polinomio personalizzato crc polynomial
ja: かすたむしーあーるしー
ko: 사용자 지정 CRC 다항식 crc polynomial
pl: crc wielomian niestandardowy crc polynomial
pt: crc polinômio personalizado crc polynomial
ro: crc personalizat polinom crc polynomial
th: CRC กำหนดเอง พหุนาม crc polynomial
tr: polinom crc polynomial
uk: поліном crc polynomial
vi: crc tùy chỉnh đa thức crc polynomial
zh_hans: 自定义 CRC 多项式 crc polynomial
zh_hant: 自訂 CRC 多項式 crc polynomial

# Cmd_analysis_hash_findAlgorithm
source: Find matching algorithm
ar: البحث عن الخوارزمية المطابقة
cs: Najít odpovídající algoritmus
de: Passenden Algorithmus suchen
el: Εύρεση αλγορίθμου που ταιριάζει
es: Buscar el algoritmo coincidente
fa: یافتن الگوریتم منطبق
fr: Rechercher l'algorithme correspondant
hu: Egyező algoritmus keresése
id: Temukan algoritme yang cocok
it: Trova algoritmo corrispondente
ja: 一致するアルゴリズムを探す
ko: 일치하는 알고리즘 찾기
pl: Znajdź pasujący algorytm
pt: Localizar algoritmo correspondente
ro: Găsire algoritm corespunzător
th: ค้นหาอัลกอริทึมที่ตรงกัน
tr: Eşleşen algoritmayı bul
uk: Знайти відповідний алгоритм
vi: Tìm thuật toán khớp
zh_hans: 查找匹配的算法
zh_hant: 尋找相符的演算法

# CmdAlias_analysis_hash_findAlgorithm
source: identify hash checksum
ar: identify hash checksum تعرّف تجزئة مجموع اختباري
cs: najít najit algoritmus určit urcit kontrolní kontrolni součet soucet identify hash checksum
de: hash prüfsumme erkennen identify hash checksum
el: αναγνώριση κατακερματισμός άθροισμα ελέγχου identify hash checksum
es: identificar hash suma de comprobación identify hash checksum
fa: شناسایی هش چک‌سام, identify hash checksum
fr: identifier hachage somme de contrôle identify hash checksum
hu: algoritmus azonosítás azonositas kivonat ellenőrzőösszeg ellenorzoosszeg identify hash checksum
id: kenali algoritme hash checksum identify hash checksum
it: identifica hash checksum somma di controllo identify hash checksum
ja: いっちするあるごりずむをさがす
ko: 일치하는 알고리즘 찾기 해시 체크섬 식별 identify hash checksum
pl: identyfikuj hash suma kontrolna identify hash checksum
pt: identificar hash soma de verificação identify hash checksum
ro: identificare hash sumă suma control identify hash checksum
th: ระบุ แฮช เช็กซัม อัลกอริทึม identify hash checksum
tr: tanımla karma sağlama toplamı identify hash checksum
uk: визначити хеш контрольна сума identify hash checksum
vi: nhận dạng thuật toán hash tổng kiểm tra identify hash checksum
zh_hans: 查找 算法 识别 哈希 校验和 identify hash checksum
zh_hant: 尋找相符的演算法 識別 雜湊 總和檢查碼 identify hash checksum

# Cmd_analysis_hash_writeAtCursor
source: Write hash value at cursor
ar: كتابة قيمة التجزئة عند المؤشر
cs: Zapsat hodnotu hash na pozici kurzoru
de: Hashwert am Cursor schreiben
el: Εγγραφή τιμής κατακερματισμού στη θέση του δρομέα
es: Escribir el valor hash en el cursor
fa: نوشتن مقدار هش در محل مکان‌نما
fr: Écrire la valeur de hachage au curseur
hu: Kivonatérték írása a kurzorhoz
id: Tulis nilai hash di kursor
it: Scrivi valore hash al cursore
ja: ハッシュ値をカーソル位置に書き込む
ko: 커서 위치에 해시 값 쓰기
pl: Zapisz wartość skrótu w miejscu kursora
pt: Gravar valor de hash no cursor
ro: Scriere valoare hash la cursor
th: เขียนค่าแฮชที่เคอร์เซอร์
tr: Karma değerini imlece yaz
uk: Записати хеш-значення в позицію курсора
vi: Ghi giá trị hash tại con trỏ
zh_hans: 在光标处写入哈希值
zh_hant: 在游標處寫入雜湊值

# CmdAlias_analysis_hash_writeAtCursor
source: checksum write insert
ar: checksum write insert مجموع اختباري كتابة إدراج
cs: zapsat vložit vlozit kontrolní kontrolni součet soucet checksum write insert
de: prüfsumme schreiben einfügen checksum write insert
el: άθροισμα ελέγχου εγγραφή εισαγωγή checksum write insert
es: suma de comprobación escribir insertar checksum write insert
fa: چک‌سام نوشتن درج, checksum write insert
fr: somme de contrôle écrire insérer checksum write insert
hu: kivonat ellenőrzőösszeg ellenorzoosszeg írás iras beszúrás checksum write insert
id: tulis sisipkan checksum hash checksum write insert
it: checksum somma di controllo scrivi inserisci checksum write insert
ja: はっしゅちをかーそるいちにかきこむ
ko: 해시 값 커서 쓰기 삽입 체크섬 checksum write insert
pl: suma kontrolna zapisz wstaw checksum write insert
pt: soma de verificação gravar inserir checksum write insert
ro: sumă suma control scriere inserare checksum write insert
th: เขียน แทรก เช็กซัม แฮช checksum write insert
tr: sağlama toplamı yaz ekle checksum write insert
uk: контрольна сума записати вставити checksum write insert
vi: ghi chèn tổng kiểm tra hash checksum write insert
zh_hans: 哈希值 校验和 写入 插入 checksum write insert
zh_hant: 寫入雜湊值 總和檢查碼 插入 checksum write insert

# Set_edit_caseConversion
source: Case conversion method
ar: طريقة تحويل حالة الأحرف
cs: Způsob převodu velikosti písmen
de: Methode der Groß-/Kleinschreibungskonvertierung
el: Μέθοδος μετατροπής πεζών-κεφαλαίων
es: Método de conversión de mayúsculas y minúsculas
fa: روش تبدیل بزرگی و کوچکی حروف
fr: Méthode de conversion de la casse
hu: Kis- és nagybetűk átalakításának módja
id: Metode konversi huruf besar/kecil
it: Metodo di conversione maiuscole/minuscole
ja: 大文字・小文字の変換の方法
ko: 대/소문자 변환 방법
pl: Metoda zmiany wielkości liter
pt: Método de conversão de maiúsculas/minúsculas
ro: Metodă de conversie majuscule/minuscule
th: วิธีแปลงตัวพิมพ์
tr: Harf dönüştürme yöntemi
uk: Спосіб зміни регістру
vi: Phương pháp chuyển chữ hoa/thường
zh_hans: 大小写转换方式
zh_hant: 大小寫轉換方式

# SetDesc_edit_caseConversion
source: How Data > Change case converts text.
ar: طريقة تحويل النص بواسطة البيانات > تغيير حالة الأحرف.
cs: Jak příkaz Data > Změnit velikost písmen převádí text.
de: Wie „Daten > Groß-/Kleinschreibung ändern“ Text konvertiert.
el: Πώς μετατρέπει το κείμενο η εντολή Δεδομένα > Αλλαγή πεζών-κεφαλαίων.
es: Cómo convierte el texto Datos > Cambiar mayúsculas y minúsculas.
fa: نحوهٔ تبدیل متن توسط داده > تغییر بزرگی و کوچکی حروف.
fr: Manière dont Données > Changer la casse convertit le texte.
hu: Hogyan alakítja át a szöveget az Adatok > Kis- és nagybetűk parancs.
id: Cara Data > Ubah huruf besar/kecil mengonversi teks.
it: Come Dati > Cambia maiuscole/minuscole converte il testo.
ja: データ > 大文字・小文字の変換で使う変換の方法。
ko: 데이터 > 대/소문자 변환에서 텍스트를 변환하는 방법입니다.
pl: Sposób konwersji tekstu przez Dane > Zmień wielkość liter.
pt: Como Dados > Alterar maiúsculas/minúsculas converte o texto.
ro: Cum convertește textul Date > Modificare majuscule/minuscule.
th: วิธีที่ ข้อมูล > เปลี่ยนตัวพิมพ์ แปลงข้อความ
tr: Veri > Büyük/küçük harf değiştir komutunun metni nasıl dönüştüreceği.
uk: Як команда «Дані» > «Змінити регістр» перетворює текст.
vi: Cách Dữ liệu > Đổi chữ hoa/thường chuyển đổi văn bản.
zh_hans: “数据 > 更改大小写”转换文本的方式。
zh_hant: 「資料 > 變更大小寫」轉換文字的方式。

# SetOpt_edit_caseConversion_ascii
source: ASCII letters only
ar: أحرف ASCII فقط
cs: Jen písmena ASCII
de: Nur ASCII-Buchstaben
el: Μόνο γράμματα ASCII
es: Solo letras ASCII
fa: فقط حروف ASCII
fr: Lettres ASCII uniquement
hu: Csak ASCII betűk
id: Hanya huruf ASCII
it: Solo lettere ASCII
ja: ASCII の英字だけ
ko: ASCII 영문자만
pl: Tylko litery ASCII
pt: Somente letras ASCII
ro: Doar literele ASCII
th: เฉพาะตัวอักษร ASCII
tr: Yalnızca ASCII harfleri
uk: Лише літери ASCII
vi: Chỉ chữ cái ASCII
zh_hans: 仅 ASCII 字母
zh_hant: 僅 ASCII 字母

# SetOpt_edit_caseConversion_encoding
source: By the display text encoding (Unicode rules)
ar: حسب ترميز نص العرض (قواعد Unicode)
cs: Podle kódování zobrazeného textu (pravidla Unicode)
de: Nach der Anzeige-Textcodierung (Unicode-Regeln)
el: Κατά την κωδικοποίηση κειμένου προβολής (κανόνες Unicode)
es: Según la codificación de texto de la vista (reglas Unicode)
fa: بر اساس رمزگذاری متن نمایش (قواعد Unicode)
fr: Selon l'encodage d'affichage du texte (règles Unicode)
hu: A megjelenítési szövegkódolás szerint (Unicode-szabályok)
id: Menurut pengodean teks tampilan (aturan Unicode)
it: Secondo la codifica del testo visualizzata (regole Unicode)
ja: 表示の文字コードに従う (Unicode の規則)
ko: 표시 텍스트 인코딩 기준(Unicode 규칙)
pl: Wg wyświetlanego kodowania tekstu (reguły Unicode)
pt: Pela codificação de texto exibida (regras Unicode)
ro: După codificarea textului afișat (reguli Unicode)
th: ตามการเข้ารหัสข้อความที่แสดง (กฎ Unicode)
tr: Görüntü metin kodlamasına göre (Unicode kuralları)
uk: За кодуванням відображуваного тексту (правила Unicode)
vi: Theo bảng mã văn bản đang hiển thị (quy tắc Unicode)
zh_hans: 按显示的文本编码（Unicode 规则）
zh_hant: 依顯示的文字編碼（Unicode 規則）

# Set_hash_customCrc
source: Custom CRCs
ar: CRC المخصصة
cs: Vlastní CRC
de: Benutzerdefinierte CRCs
el: Προσαρμοσμένα CRC
es: CRC personalizados
fa: CRCهای سفارشی
fr: CRC personnalisés
hu: Egyéni CRC-k
id: CRC kustom
it: CRC personalizzati
ja: カスタム CRC
ko: 사용자 지정 CRC
pl: Niestandardowe CRC
pt: CRCs personalizados
ro: CRC-uri personalizate
th: CRC ที่กำหนดเอง
tr: Özel CRC'ler
uk: Власні CRC
vi: CRC tùy chỉnh
zh_hans: 自定义 CRC
zh_hant: 自訂 CRC

# SetDesc_hash_customCrc
source: The custom CRC algorithms defined in the hash panel.
ar: خوارزميات CRC المخصصة المعرّفة في لوحة التجزئة.
cs: Vlastní algoritmy CRC definované v panelu hash.
de: Die im Hash-Bereich definierten benutzerdefinierten CRC-Algorithmen.
el: Οι προσαρμοσμένοι αλγόριθμοι CRC που ορίστηκαν στο πλαίσιο κατακερματισμού.
es: Los algoritmos CRC personalizados definidos en el panel de hash.
fa: الگوریتم‌های CRC سفارشی که در پنل هش تعریف شده‌اند.
fr: Les algorithmes CRC personnalisés définis dans le volet de hachage.
hu: A Kivonat panelen definiált egyéni CRC-algoritmusok.
id: Algoritme CRC kustom yang didefinisikan di panel hash.
it: Gli algoritmi CRC personalizzati definiti nel pannello Hash.
ja: ハッシュパネルで定義したカスタム CRC。
ko: 해시 패널에서 정의한 사용자 지정 CRC 알고리즘입니다.
pl: Niestandardowe algorytmy CRC zdefiniowane w panelu skrótów.
pt: Os algoritmos CRC personalizados definidos no painel Hash.
ro: Algoritmii CRC personalizați definiți în panoul hash.
th: อัลกอริทึม CRC ที่กำหนดเองในแผงแฮช
tr: Karma panelinde tanımlanan özel CRC algoritmaları.
uk: Власні алгоритми CRC, визначені на панелі хешу.
vi: Các thuật toán CRC tùy chỉnh được định nghĩa trong bảng hash.
zh_hans: 在哈希面板中定义的自定义 CRC 算法。
zh_hant: 在雜湊面板中定義的自訂 CRC 演算法。

# Operation_ConvertEncoding
source: Convert encoding
ar: تحويل الترميز
cs: Převod kódování
de: Codierung konvertieren
el: Μετατροπή κωδικοποίησης
es: Convertir codificación
fa: تبدیل رمزگذاری
fr: Conversion de l'encodage
hu: Kódolás átalakítása
id: Konversi pengodean
it: Converti codifica
ja: 文字コード変換
ko: 인코딩 변환
pl: Konwertuj kodowanie
pt: Converter codificação
ro: Conversie codificare
th: แปลงการเข้ารหัส
tr: Kodlamayı dönüştür
uk: Перетворення кодування
vi: Chuyển đổi bảng mã
zh_hans: 转换编码
zh_hant: 轉換編碼

# Operation_ConvertCase
source: Change case
ar: تغيير حالة الأحرف
cs: Změna velikosti písmen
de: Groß-/Kleinschreibung ändern
el: Αλλαγή πεζών-κεφαλαίων
es: Cambiar mayúsculas y minúsculas
fa: تغییر بزرگی و کوچکی حروف
fr: Changement de casse
hu: Kis- és nagybetűk átalakítása
id: Ubah huruf besar/kecil
it: Cambia maiuscole/minuscole
ja: 大文字・小文字の変換
ko: 대/소문자 변환
pl: Zmień wielkość liter
pt: Alterar maiúsculas/minúsculas
ro: Modificare majuscule/minuscule
th: เปลี่ยนตัวพิมพ์
tr: Büyük/küçük harf değiştir
uk: Зміна регістру
vi: Đổi chữ hoa/thường
zh_hans: 更改大小写
zh_hant: 變更大小寫

# Operation_FindAlgorithm
source: Find matching algorithm
ar: البحث عن الخوارزمية المطابقة
cs: Hledání odpovídajícího algoritmu
de: Passenden Algorithmus suchen
el: Εύρεση αλγορίθμου που ταιριάζει
es: Buscar el algoritmo coincidente
fa: یافتن الگوریتم منطبق
fr: Recherche de l'algorithme correspondant
hu: Egyező algoritmus keresése
id: Temukan algoritme yang cocok
it: Trova algoritmo corrispondente
ja: 一致するアルゴリズムを探す
ko: 일치하는 알고리즘 찾기
pl: Znajdź pasujący algorytm
pt: Localizar algoritmo correspondente
ro: Găsire algoritm corespunzător
th: ค้นหาอัลกอริทึมที่ตรงกัน
tr: Eşleşen algoritmayı bul
uk: Пошук відповідного алгоритму
vi: Tìm thuật toán khớp
zh_hans: 查找匹配的算法
zh_hant: 尋找相符的演算法

# ConvertEncoding_Title
source: Convert encoding
ar: تحويل الترميز
cs: Převést kódování
de: Codierung konvertieren
el: Μετατροπή κωδικοποίησης
es: Convertir codificación
fa: تبدیل رمزگذاری
fr: Convertir l'encodage
hu: Kódolás átalakítása
id: Konversi pengodean
it: Converti codifica
ja: 文字コード変換
ko: 인코딩 변환
pl: Konwertuj kodowanie
pt: Converter codificação
ro: Conversie codificare
th: แปลงการเข้ารหัส
tr: Kodlamayı dönüştür
uk: Перетворення кодування
vi: Chuyển đổi bảng mã
zh_hans: 转换编码
zh_hant: 轉換編碼

# ConvertEncoding_Convert
source: Convert
ar: تحويل
cs: Převést
de: Konvertieren
el: Μετατροπή
es: Convertir
fa: تبدیل
fr: Convertir
hu: Átalakítás
id: Konversi
it: Converti
ja: 変換
ko: 변환
pl: Konwertuj
pt: Converter
ro: Conversie
th: แปลง
tr: Dönüştür
uk: Перетворити
vi: Chuyển đổi
zh_hans: 转换
zh_hant: 轉換

# ConvertEncoding_Source
source: From
ar: من
cs: Z
de: Von
el: Από
es: De
fa: از
fr: De
hu: Forrás
id: Dari
it: Da
ja: 変換元の文字コード
ko: 원본
pl: Z
pt: De
ro: Din
th: จาก
tr: Kaynak
uk: З
vi: Từ
zh_hans: 源编码
zh_hant: 來源

# ConvertEncoding_Target
source: To
ar: إلى
cs: Do
de: Nach
el: Σε
es: A
fa: به
fr: Vers
hu: Cél
id: Ke
it: A
ja: 変換先の文字コード
ko: 대상
pl: Na
pt: Para
ro: În
th: เป็น
tr: Hedef
uk: У
vi: Sang
zh_hans: 目标编码
zh_hant: 目標

# ConvertEncoding_Invalid
source: Bytes that cannot be decoded
ar: البايتات التي يتعذر فك ترميزها
cs: Bajty, které nelze dekódovat
de: Bytes, die nicht decodiert werden können
el: Byte που δεν μπορούν να αποκωδικοποιηθούν
es: Bytes que no se pueden decodificar
fa: بایت‌هایی که قابل رمزگشایی نیستند
fr: Octets qui ne peuvent pas être décodés
hu: Nem dekódolható bájtok
id: Byte yang tidak dapat didekode
it: Byte che non possono essere decodificati
ja: 変換元で解釈できないバイト列
ko: 디코딩할 수 없는 바이트
pl: Bajty, których nie można zdekodować
pt: Bytes que não podem ser decodificados
ro: Octeți care nu pot fi decodificați
th: ไบต์ที่ถอดรหัสไม่ได้
tr: Çözülemeyen baytlar
uk: Байти, які не можна декодувати
vi: Byte không thể giải mã
zh_hans: 无法解码的字节
zh_hant: 無法解碼的位元組
